Highcharts.chart('boxplot', {

    chart: {
      type: 'boxplot'
    },
  
    title: {
      text: 'งบประมาณประจำจังหวัดมุกดาหาร 2553-2562'
    },
  
    legend: {
      enabled: false
    },
  
    xAxis: {
      categories: ['กระทรวงคมนาคม','กระทรวงเกษตรและสหกรณ์','กระทรวงแรงงาน','กระทรวงกลาโหม','กระทรวงการคลัง','กระทรวงการท่องเที่ยวและกีฬา','กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์','กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม','กระทรวงมหาดไทย','กระทรวงยุติธรรม','กระทรวงวัฒนธรรม','กระทรวงศึกษาธิการ','กระทรวงสาธารณสุข'
      ],
      title: {
        text: 'กระทรวง'
      }
    },
  
    yAxis: {
      title: {
        text: 'baht'
      },
      plotLines: [{
        value: 932,
        color: 'red',
        width: 1,
        label: {
          text: 'Theoretical mean: 932',
          align: 'center',
          style: {
            color: 'gray'
          }
        }
      }]
    },
  
    series: [{
      name: 'Observations',
      data: [
        [44452800,-1318628298,675407603,2692309979,2092449100],
        [8439640,-758358402,5232009637,1293684202,690603990],
        [0,-25222987.88,11510037,46143913.13,32154134],
        [4413800,-34674818.13,19926432,77703530.88,42168900],
        [1973900,-9013648.75,17469913,34203789.25,60043700],
        [0,-3436630,4956908,8429926,27460000],
        [4994400,-411904568.5,214698988,715647547.5,542511800],
        [1446299,-66220401.25,39807950,151368200.8,96480877],
        [60269300,96651330.38,884803397,1541345927,2199544888],
        [3994400,2068548.75,28605781,54212618.75,44391015],
        [13000,-1720297.5,2349800,5577562.5,7341600],
        [18620400,-151785671.5,194486052,536654538.5,407517354],
        [4698300,-55626975,84372479,211271825,185006631]
        
      ],
      tooltip: {
        headerFormat: '<em> {point.key}</em><br/>'
      }
    }, {
      name: 'Outlier',
      color: Highcharts.getOptions().colors[0],
      type: 'scatter',
      data: [ // x, y positions where 0 is the first category
        [4, 60043700 ],
        [4, 41464000],
        [5, 27460000],
        [8, 60269300],
        [8, 2199544888],
        [10, 7341600]
      ],
      marker: {
        fillColor: 'white',
        lineWidth: 1,
        lineColor: Highcharts.getOptions().colors[0]
      },
      tooltip: {
        pointFormat: 'Observation: {point.y}'
      }
    }]
  
  });
  


