Highcharts.chart('timeseries', {
    chart: {
      type: 'spline'
    },
  
    accessibility: {
      description: 'Most commonly used desktop screen readers from January 2009 to July 2015 as reported in the Webaim Survey. JAWS remains the most used screen reader, but is steadily declining. ZoomText and WindowEyes are both displaying large growth from 2014 to 2015.'
    },
  
    legend: {
      symbolWidth: 40
    },
  
    title: {
      text: 'งบประมาณจังหวัดมุกดาหาร 2553 - 2562'
    },
  
    
    yAxis: {
      title: {
        text: 'baht'
      }
    },
  
    xAxis: {
      title: {
        text: 'year'
      },
      accessibility: {
        description: 'Time from 2010 to July 2019'
      },
      categories: ['2010', '2011', '2012', '2013','2014','2015','2016','2017','2018','2019']
    },
  
    tooltip: {
      split: true
    },
  
    plotOptions: {
      series: {
        point: {
          events: {
            click: function () {
              window.location.href = this.series.options.website;
            }
          }
        },
        cursor: 'pointer'
      }
    },
  
    series: [
      {
        name: 'กระทรวงคมนาคม',
        data: [2092449100,1401797800,1376495300,623346600,470115838,226176135,183294481,192010780,143937200,44452800],
        
      }, {
        name: 'กระทรวงเกษตรและสหกรณ์',
        data: [545510100,545198300,690603990,461078000,18881936,17597801,8439640,13207756,10474180,9104670],
        
      }, {
        name: 'กระทรวงแรงงาน',
        data: [5695200,7844420,1955400,1401000,29606506,20540796,32154134,15902913,0,0],
        
      }, {
        name: 'กระทรวงกลาโหม',
        data: [42168900,38494500,38801200,26763100,17769380,9161700,7539260,4413800,7442997,6709484],
        
      }, {
        name: 'กระทรวงการคลัง',
        data: [11506300,7973800,19112000,60043700,14653000,41464000,7250000,7173854,1973900,3548580],
        
      }, {
        name: 'กระทรวงการท่องเที่ยวและกีฬาSystem',
        data: [27460000,0,97400,356800,4820300,2982914,4031920,3002545,3824110,2993090],
        
      }, {
        name: 'กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์',
        data: [4994400,11369900,10288300,10780000,542511800,254968100,208118100,276636900,529114011,298208372],
        
      }, {
        name: 'กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม',
        data: [1835200,50963300,76092570,76042200,96480877,26848660,32603540,12867222,22899632,1446299],
        
      }, {
        name: 'กระทรวงมหาดไทย',
        data: [683550200,680659500,887774400,2199544888,1437612120,1032200664,901739822,60269300,340353838,624329239],
        
      }, {
        name: 'กระทรวงยุติธรรม',
        data: [3994400,18038000,34214300,19262900,44391015,34806690,40740720,31595449,28701600,30312734],
        
      }, {
        name: 'กระทรวงวัฒนธรรม',
        data: [251700,735700,13000,1858500,7341600,4136200,3021660,1968600,2298480,1872560],
        
      }, {
        name: 'กระทรวงศึกษาธิการ',
        data: [407517354,387517553,159369420,160342220,291431493,239663360,115071953,61844878,103481892,18620400],
        
      }, {
        name: 'กระทรวงสาธารณสุข',
        data: [129212000,87081900,111356000,110671100,87273654,30252800,5362000,185006631,92810402,4698300],
        
      }
    ],
  
    responsive: {
      rules: [{
        condition: {
          maxWidth: 500
        },
        chartOptions: {
          legend: {
            itemWidth: 150
          }
        }
      }]
    }
  });
  	
